benchmark-results/round-2-amd/1.txt
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  99 secs]  0 threads:    96000000 ops,  951972 (avg:  967135) ops/sec, 61.63MB/sec (avg: 62.62MB/sec),  0.81 (avg:  0.79) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       967074.64          ---          ---         0.79357         0.79100         0.80700         0.81500         0.83900         1.32700         2.54300         2.67100         2.83100         3.18300     64115.08
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     967074.64         0.00         0.00         0.79357         0.79100         0.80700         0.81500         0.83900         1.32700         2.54300         2.67100         2.83100         3.18300     64115.08
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  95 secs]  0 threads:    96000000 ops, 1008767 (avg: 1007046) ops/sec, 42.03MB/sec (avg: 41.93MB/sec),  0.76 (avg:  0.76) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        91545.33          ---          ---         0.76208         0.76700         0.77500         0.78300         0.79900         1.01500         1.83100         1.94300         2.09500         2.27100      6078.57
Gets       915443.19      9895.68    905547.51         0.76204         0.76700         0.77500         0.78300         0.79900         1.00700         1.83100         1.94300         2.07900         2.27100     36859.61
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    1006988.51      9895.68    905547.51         0.76205         0.76700         0.77500         0.78300         0.79900         1.00700         1.83100         1.94300         2.07900         2.27100     42938.18
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  61 secs]  0 threads:     9600000 ops,  156265 (avg:  155061) ops/sec, 6.51MB/sec (avg: 6.46MB/sec),  0.61 (avg:  0.62) msec latency

8         Threads
12        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        14095.83          ---          ---         0.61951         0.62300         0.63100         0.63900         0.65500         0.68700         1.54300         1.68700         1.81500         1.92700       935.95
Gets       140956.80      1676.12    139280.68         0.61920         0.62300         0.63100         0.63900         0.65500         0.70300         1.55100         1.66300         1.80700         1.96700      5678.76
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     155052.63      1676.12    139280.68         0.61923         0.62300         0.63100         0.63900         0.65500         0.69500         1.55100         1.66300         1.81500         1.96700      6614.71
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%, 100 secs]  0 threads:    96000000 ops,  948765 (avg:  952730) ops/sec, 57.31MB/sec (avg: 57.55MB/sec),  0.81 (avg:  0.80) msec latency

8         Threads
12        Connections per thread
1000000   Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        86605.68          ---          ---         0.80547         0.80700         0.82300         0.83100         0.84700         1.07900         1.90300         2.01500         2.15900         2.41500      5741.87
Gets       866047.28    866047.28         0.00         0.80546         0.80700         0.82300         0.83100         0.84700         1.07900         1.90300         2.01500         2.15900         2.41500     53188.33
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     952652.96    866047.28         0.00         0.80546         0.80700         0.82300         0.83100         0.84700         1.07900         1.90300         2.01500         2.15900         2.41500     58930.20
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  62 secs]  0 threads:     9600000 ops,  154908 (avg:  153714) ops/sec, 9.36MB/sec (avg: 9.29MB/sec),  0.62 (avg:  0.62) msec latency

8         Threads
12        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        13973.36          ---          ---         0.62479         0.63100         0.63900         0.64700         0.66300         0.71900         1.54300         1.65500         1.79900         1.90300       926.34
Gets       139732.10    139732.10         0.00         0.62462         0.62300         0.63900         0.64700         0.66300         0.74300         1.53500         1.65500         1.79900         1.98300      8581.56
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     153705.47    139732.10         0.00         0.62464         0.62300         0.63900         0.64700         0.66300         0.73500         1.53500         1.65500         1.79900         1.98300      9507.90